Repository: linroger/SwiftMandarin
Catalog: SwiftMandarin/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Recommended: gpt-oss:20b for best quality.
zh_hans: 推荐：gpt-oss:20b 以获得最佳质量。

source: Refresh Models
zh_hans: 刷新模型

source: Regenerate
zh_hans: 重新生成

source: Regenerate explanation
zh_hans: 重新生成解释

source: Relearn
zh_hans: 重新学习

source: Reminder Time
zh_hans: 提醒时间

source: Replay slowly
zh_hans: 慢速重播

source: Reset
zh_hans: 重置

source: Reset Learning Progress
zh_hans: 重置学习进度

source: Reset Progress
zh_hans: 重置进度

source: Restore
zh_hans: 恢复

source: Retry
zh_hans: 重试

source: Reveal
zh_hans: 显示答案

source: Reverse Translate
zh_hans: 反向翻译

source: Review
zh_hans: 复习

source: Review Mode
zh_hans: 复习模式

source: Review now
zh_hans: 立即复习

source: Review Reminders
zh_hans: 复习提醒

source: Review these
zh_hans: 回顾这些

source: Reviews
zh_hans: 复习次数

source: reviews a day
zh_hans: 次复习／天

source: Reviews today
zh_hans: 今日复习

source: Reviews: %lld
zh_hans: 复习次数：%lld

source: Roleplay real dialogues with an AI partner
zh_hans: 与 AI 伙伴角色扮演真实对话

source: Round complete
zh_hans: 本轮完成

source: Running in the background using %@. You can leave this screen — the analysis keeps going and you'll see the live count when you return.
zh_hans: 正在后台使用 %@ 运行。你可以离开此页面——分析会继续进行，返回时可看到实时进度。

source: Save
zh_hans: 保存

source: Save ${chinese} to vocabulary
zh_hans: 将 ${chinese} 保存到词汇本

source: Save a Chinese word or phrase to your vocabulary list.
zh_hans: 将中文单词或短语保存到您的词汇列表。

source: Save a few vocabulary words and come back for a round.
zh_hans: 先保存一些词汇，再来练一轮吧。

source: Save as Phrase
zh_hans: 保存为短语

source: Save some two-character Mandarin words to unlock tone drills.
zh_hans: 保存一些双字中文词即可解锁声调训练。

source: Save some words from the Translate tab to study them here
zh_hans: 从翻译页面保存一些单词，然后在这里学习

source: Save to File...
zh_hans: 保存到文件…

source: Save to History Automatically
zh_hans: 自动保存到历史

source: Save to Vocabulary
zh_hans: 保存到词汇本

source: Save Translations to History
zh_hans: 保存翻译到历史

source: Save Vocabulary Term
zh_hans: 保存词汇

source: Save Word
zh_hans: 保存单词

source: Save words from translations to build your vocabulary
zh_hans: 保存翻译中的单词来建立您的词汇表

source: Saved
zh_hans: 已保存

source: Saved Term
zh_hans: 已保存词汇

source: Saved to File
zh_hans: 已保存到文件

source: Saved to vocabulary.
zh_hans: 已保存到词汇本。

source: Saved Words
zh_hans: 已保存单词

source: Scan
zh_hans: 扫描

source: Screenshots
zh_hans: 截图

source: Search history
zh_hans: 搜索历史

source: Search phrases
zh_hans: 搜索短语

source: Search phrases...
zh_hans: 搜索短语...

source: Search vocabulary
zh_hans: 搜索词汇

source: Search vocabulary...
zh_hans: 搜索词汇...

source: Search your saved vocabulary and return matching terms.
zh_hans: 搜索已保存的词汇并返回匹配的条目。

source: See All
zh_hans: 查看全部

source: Select screenshots to translate using the Shortcuts app or share sheet
zh_hans: 通过“快捷指令”App 或分享菜单选择要翻译的截图

source: Send
zh_hans: 发送

source: Send via Messages, Mail, AirDrop...
zh_hans: 通过信息、邮件、隔空投送等发送…

source: Server URL
zh_hans: 服务器地址

source: Session Complete!
zh_hans: 学习完成！

source: Set your daily goal
zh_hans: 设定每日目标

source: Settings
zh_hans: 设置

source: Settings (⌘,)
zh_hans: 设置 (⌘,)

source: Share
zh_hans: 分享

source: Share App
zh_hans: 分享应用

source: Shopping
zh_hans: 购物

source: Shortcuts
zh_hans: 快捷键

source: Show Dock Icon
zh_hans: 显示程序坞图标

source: Show Hints
zh_hans: 显示提示

source: Show Image Preview
zh_hans: 显示图片预览

source: Show in Menu Bar
zh_hans: 在菜单栏显示

source: Show Original Text
zh_hans: 显示原文

source: Show pinyin
zh_hans: 显示拼音

source: Show Pinyin
zh_hans: 显示拼音

source: Show Streak
zh_hans: 显示连续天数

source: Show Word Borders
zh_hans: 显示词汇边框

source: Simple future: will / be going to + base verb
zh_hans: 一般将来时 (Simple Future)：will/be going to + 动词原形

source: Simple past: verb in past form
zh_hans: 一般过去时 (Simple Past)：动词过去式

source: Size
zh_hans: 大小

source: Skip
zh_hans: 跳过

source: Slow
zh_hans: 慢速

source: Small
zh_hans: 小

source: Small daily sessions beat marathon cramming. You can change this anytime from Home.
zh_hans: 每天少量练习胜过突击死记。之后可随时在首页修改。

source: Smaller Text
zh_hans: 缩小字体

source: Sort
zh_hans: 排序

source: Sort by
zh_hans: 排序方式

source: Source
zh_hans: 来源

source: Speak
zh_hans: 朗读

source: Speak ${text}
zh_hans: 朗读 ${text}

source: Speak and translate in real time
zh_hans: 边说边译，实时翻译

source: Speak Phrase
zh_hans: 朗读短语

source: Speak Translation
zh_hans: 朗读翻译

source: Speaking
zh_hans: 正在朗读

source: Speaking Speed
zh_hans: 朗读语速

source: Speech
zh_hans: 语音

source: Start learning
zh_hans: 开始学习

source: Start New Session
zh_hans: 开始新一轮

source: Start Over
zh_hans: 重新开始

source: Start Review
zh_hans: 开始复习

source: Start review with ${reviewMode}
zh_hans: 以 ${reviewMode} 开始复习

source: Start Translating
zh_hans: 开始翻译

source: Startup
zh_hans: 启动

source: Statistics
zh_hans: 统计

source: Stats
zh_hans: 统计

source: Stats Range
zh_hans: 统计范围

source: Status
zh_hans: 状态

source: Stitch multiple screenshots together, extract text, and translate to English or Chinese. Perfect for translating long web pages or documents captured as multiple screenshots.
zh_hans: 将多张截图拼接在一起，提取文字并翻译为英文或中文。非常适合翻译以多张截图捕获的长网页或文档。

source: Stitched Image
zh_hans: 拼接后的图片

source: Stop recording
zh_hans: 停止录音

source: Stored securely in the Keychain, separately for each provider. %@.
zh_hans: 安全存储在钥匙串中，每个提供方单独保存。%@。

source: Stories at your level
zh_hans: 适合你水平的故事

source: Story generation failed: %@
zh_hans: 故事生成失败：%@

source: STSong
zh_hans: 华文宋体

source: Study
zh_hans: 学习

source: Study All Cards
zh_hans: 学习全部卡片

source: Study Mode
zh_hans: 学习模式

source: Superlative: the + adjective-est / the most + adjective
zh_hans: 最高级：the + 形容词+est / the most + 形容词

source: Supported
zh_hans: 支持

source: Supports image input (vision) for photo cleanup
zh_hans: 支持图像输入（视觉）以进行照片清理

source: SwiftMandarin
zh_hans: 中文快译

source: SwiftMandarin is a modern Mandarin Chinese translation and learning app built with SwiftUI for iOS 17 and later. It features real-time translation, vocabulary management, flashcard learning with spaced repetition, and a comprehensive phrase library.
zh_hans: 中文快译是一款使用 SwiftUI 构建的现代中文翻译与学习应用，支持 iOS 17 及更高版本。它具有实时翻译、词汇管理、间隔重复闪卡学习和综合短语库等功能。

source: Switch the entire app between the English and Mandarin versions.
zh_hans: 在英文版和中文版之间切换整个应用。

source: System Default
zh_hans: 系统默认

# tab.history
source: History
zh_hans: 历史

# tab.learn
source: Learn
zh_hans: 学习

# tab.more
source: More
zh_hans: 更多

# tab.phrases
source: Phrases
zh_hans: 短语

# tab.stats
source: Stats
zh_hans: 统计

# tab.translate
source: Translate
zh_hans: 翻译

# tab.vocabulary
source: Vocabulary
zh_hans: 词汇

source: Tap a button below to translate
zh_hans: 点按下方按钮进行翻译

source: Tap card to reveal answer
zh_hans: 点击卡片查看答案

source: Tap Refresh Models to fetch the live model list from the provider.
zh_hans: 点按“刷新模型”以从服务商获取实时模型列表。

source: Tap the button below to translate
zh_hans: 点击下方按钮开始翻译

source: Tap the microphone and start speaking. Your words will be transcribed and translated in real-time.
zh_hans: 点按麦克风并开始说话。 您的话语将被实时转录并翻译。

source: Tap to speak
zh_hans: 点按以朗读

source: Target Language
zh_hans: 目标语言

source: Test Connection
zh_hans: 测试连接

source: Text
zh_hans: 文本

source: Text Size
zh_hans: 文字大小

source: The language to translate the text into.
zh_hans: 要将文本翻译成的语言。

source: The language to translate the text into. Defaults to the app's interface language (your native language).
zh_hans: 要将文本翻译成的语言。默认为应用界面语言（您的母语）。

source: The model could not find any questions in the images — the pages may be blank or unreadable, or the model may lack vision capability. Try clearer photos or a stronger vision model (e.g. qwen-vl-max, gpt-4o) in Settings → AI.
zh_hans: 模型未能在图片中找到任何题目 — 页面可能为空白或无法辨认，或所选模型不具备视觉能力。请尝试更清晰的照片，或在 设置 → AI 中改用更强的视觉模型（如 qwen-vl-max、gpt-4o）。

source: The model returned an empty response. Try again or pick a different vision model.
zh_hans: 模型返回了空响应。请重试或更换视觉模型。

source: The model returned an empty story.
zh_hans: 模型返回了空故事。

source: The model's response couldn't be read as grading data. Try a more capable vision model (e.g. qwen-vl-max or qwen-vl-plus) in Settings → AI.
zh_hans: 无法将模型的响应解析为批改数据。请在 设置 → AI 中改用能力更强的视觉模型（如 qwen-vl-max 或 qwen-vl-plus）。

source: The response could not be read.
zh_hans: 无法读取响应。

source: The story reuses words you've already saved, so most of it will feel familiar.
zh_hans: 故事会尽量使用你已保存的词汇，读起来大多会很熟悉。

source: This provider cannot read images, so photo cleanup against the image and workbook grading will use a different vision-capable provider if one is configured.
zh_hans: 该服务商无法读取图片，因此基于图片的照片清理和作业批改将改用已配置的其他视觉模型服务商（如有）。

source: This provider has no model-list endpoint; showing curated defaults. Enter a custom model ID if needed.
zh_hans: 该服务商没有模型列表端点；正在显示精选默认值。如有需要，请输入自定义模型 ID。

source: This word was removed from your vocabulary.
zh_hans: 该词已从你的词汇表中移除。

source: This removes every saved translation and cannot be undone.
zh_hans: 这将删除所有已保存的翻译记录，且无法撤销。

source: This text is empty.
zh_hans: 这篇文本是空的。

source: This Week
zh_hans: 本周

source: This will delete %lld saved AI explanations. They will be regenerated the next time you open those words.
zh_hans: 这将删除 %lld 条已保存的 AI 解释。下次打开这些单词时将重新生成。

source: This will delete all %lld history entries. This action cannot be undone.
zh_hans: 这将删除所有 %lld 条历史记录。此操作无法撤销。

source: This will delete all %lld saved words. This action cannot be undone.
zh_hans: 这将删除所有 %lld 个已保存的单词。此操作无法撤销。

source: This will reset all learning progress. This action cannot be undone.
zh_hans: 这将重置所有学习进度。此操作无法撤销。

source: Time
zh_hans: 时间

source: Time & Numbers
zh_hans: 时间与数字

source: Title
zh_hans: 标题

source: Today
zh_hans: 今天

source: Tone Colors
zh_hans: 声调颜色

source: Tone Drills
zh_hans: 声调训练

source: Tone drills are for Mandarin learners
zh_hans: 声调训练面向中文学习者

source: Tone practice unlocks when you are learning Chinese.
zh_hans: 学习中文时才会解锁声调练习。

source: Topic (optional)
zh_hans: 主题（可选）

source: Total
zh_hans: 总计

source: Total Cards
zh_hans: 总卡片数

source: Total Reviews
zh_hans: 总复习次数

source: Total Words
zh_hans: 总单词数

source: Train your ear for tones
zh_hans: 训练你的声调听力

source: Transcript
zh_hans: 转录文本

source: Translate
zh_hans: 翻译

source: Translate \${images} to \${targetLanguage}
zh_hans: 将 \${images} 翻译为 \${targetLanguage}

source: Translate ${text} with ${direction}
zh_hans: 用 ${direction} 翻译 ${text}

source: Translate and speak text in the target language, or speak the original text.
zh_hans: 用目标语言翻译并朗读文本，或朗读原文。

source: Translate anything, scan the world around you, read at your level, and remember it all with a few minutes of daily review.
zh_hans: 翻译任何内容、扫描身边的世界、阅读适合你水平的文本，再用每天几分钟的复习牢牢记住这一切。

source: Translate Chinese to English
zh_hans: 将中文翻译为英文

source: Translate Clipboard
zh_hans: 翻译剪贴板

source: Translate clipboard with ${direction}
zh_hans: 用 ${direction} 翻译剪贴板

source: Translate English to Chinese
zh_hans: 将英文翻译为中文

source: Translate into your native language
zh_hans: 翻译成您的母语

source: Translate Now
zh_hans: 立即翻译

source: Translate on Paste
zh_hans: 粘贴时翻译

source: Translate Paragraph
zh_hans: 翻译本段

source: Translate Screenshots
zh_hans: 翻译截图

source: Translate Text
zh_hans: 翻译文本

source: Translate text between English and Chinese. Optionally save Chinese phrases (2+ characters) to vocabulary with auto-detected part of speech.
zh_hans: 在英文和中文之间翻译文本。可选择将中文短语（2 个及以上字符）连同自动检测的词性一并保存到词汇本。

source: Translate text from the clipboard. Optionally save Chinese phrases (2+ characters) to vocabulary with auto-detected part of speech.
zh_hans: 翻译剪贴板中的文本。可选择将中文短语（2 个及以上字符）连同自动检测的词性一并保存到词汇本。

source: Translate with %@
zh_hans: 用 %@ 翻译

source: Translate with Apple Translation
zh_hans: 使用 Apple 翻译

source: Translated Content
zh_hans: 翻译内容

source: Translated Text
zh_hans: 译文

source: Translating with %@…
zh_hans: 正在使用 %@ 翻译…

source: Translating with Apple Intelligence...
zh_hans: 正在使用 Apple Intelligence 翻译…

source: Translating...
zh_hans: 翻译中...

source: Translating…
zh_hans: 翻译中…

source: Translation
zh_hans: 翻译

source: Translation & AI powered by Apple Translation, on-device Ollama, and configured cloud providers including OpenAI, Claude, DeepSeek, and Qwen.
zh_hans: 翻译与 AI 由 Apple 翻译、本地 Ollama，以及已配置的云端服务（包括 OpenAI、Claude、DeepSeek 和通义千问）提供支持。

source: Translation Behavior
zh_hans: 翻译行为

source: Translation complete.
zh_hans: 翻译完成。

source: Translation failed.
zh_hans: 翻译失败。

source: Translation Direction
zh_hans: 翻译方向

source: Translation Error
zh_hans: 翻译错误

source: Translation Failed
zh_hans: 翻译失败

source: Translation History
zh_hans: 翻译历史

source: Translation powered by Apple Translation API
zh_hans: 翻译由 Apple 翻译 API 提供支持

source: Translation will appear here
zh_hans: 翻译结果将显示在这里

source: Translation will start automatically
zh_hans: 翻译将自动开始

source: Translations
zh_hans: 翻译次数

source: Translations: %lld
zh_hans: 翻译次数：%lld

source: Travel
zh_hans: 旅行

source: Try Again
zh_hans: 重试

source: Turn off to use popup details instead of the inspector.
zh_hans: 关闭后将使用弹出式详情而非检查器。

source: Type
zh_hans: 类型

source: Type or paste text above to translate
zh_hans: 在上方输入或粘贴文本进行翻译

source: Type what you hear
zh_hans: 输入你听到的内容

source: Typography
zh_hans: 排版

source: Unmaster
zh_hans: 取消掌握

source: Untitled
zh_hans: 未命名

source: Upcoming Reviews
zh_hans: 即将到来的复习

source: Update Saved Definition
zh_hans: 更新已保存的释义

source: Upload the workbook pages. If the answers are written on the pages, just add the pages — the AI detects them automatically. Add separate answer photos only if the answers are on a different sheet.
zh_hans: 上传作业页面。如果答案就写在页面上，只需添加这些页面——AI 会自动识别。仅当答案在另一张纸上时，才需另外添加答案照片。

source: Usage Note
zh_hans: 用法说明

source: Use %@
zh_hans: 使用 %@

source: Use ⌘, or the gear button to open Settings
zh_hans: 使用 ⌘, 或点击齿轮按钮打开设置

source: Use Apple Intelligence
zh_hans: 使用 Apple Intelligence

source: Use Inspector for Vocabulary Details
zh_hans: 使用检查器查看词汇详情

source: Use Original
zh_hans: 使用原文

source: Use original text
zh_hans: 使用原文

source: Use Translation
zh_hans: 使用译文

source: Uses on-device Foundation Models for privacy-focused AI.
zh_hans: 使用设备端 Foundation Models，以隐私为中心的 AI 体验。

source: Using %@
zh_hans: 正在使用 %@

source: Using %@.
zh_hans: 使用 %@。

source: Using on-device AI for translation
zh_hans: 正在使用设备端 AI 进行翻译

source: Using your configured AI provider
zh_hans: 使用你配置的 AI 服务商

source: Verb
zh_hans: 动词

source: Version
zh_hans: 版本

source: Version 1.0.0
zh_hans: 版本 1.0.0

source: Vision
zh_hans: 视觉（图像）

source: Vocabulary
zh_hans: 词汇

source: Vocabulary by Type
zh_hans: 词汇类型分布

source: Vocabulary Mastery
zh_hans: 词汇掌握度

source: Vocabulary Text Size
zh_hans: 词汇文字大小

source: Voice Translation
zh_hans: 语音翻译

source: Welcome to SwiftMandarin
zh_hans: 欢迎使用 SwiftMandarin

source: When enabled, translation runs automatically as you type. When disabled, tap the Translate button after entering text.
zh_hans: 启用后，输入时会自动翻译。禁用后，需要在输入文本后点击翻译按钮。

source: When on, scanned photos are sent to the selected AI provider to fix OCR errors before translation. Vision-capable providers also receive the image.
zh_hans: 开启后，扫描的照片会在翻译前发送给所选 AI 服务商以修正 OCR 错误。支持视觉的服务商还会接收该图像。

source: Which tone pattern do you hear?
zh_hans: 你听到的是哪种声调组合？

source: Word %lld of %lld
zh_hans: 第 %lld 个词，共 %lld 个

source: Word Details
zh_hans: 词汇详情

source: Word No Longer Available
zh_hans: 该词已不可用

source: Word explanations, graded stories, conversation practice, and workbook grading come alive with AI. They work with Apple Intelligence, a local Ollama server, or any cloud key you add later in Settings → AI.
zh_hans: 词语讲解、分级故事、对话练习和作业批改都由 AI 赋能。支持 Apple 智能、本地 Ollama 服务器，或稍后在“设置 → AI”中添加的任意云端密钥。

source: Word of the Day
zh_hans: 每日一词

source: Words
zh_hans: 单词

source: Words in Parallel
zh_hans: 并行词数

source: Words Learned
zh_hans: 已学单词

source: Words learned: %lld
zh_hans: 已学单词：%lld

source: Words saved
zh_hans: 已保存词汇

source: Words Saved
zh_hans: 已保存单词

source: Words you save while translating will appear here
zh_hans: 翻译时保存的单词将显示在这里

source: Words you save will appear here.
zh_hans: 你保存的词汇会显示在这里。

source: Workbook grading
zh_hans: 作业批改

source: Workbook grading needs a vision-capable provider with an API key — OpenAI, Claude, Qwen, Doubao, Zhipu, or Kimi. Add one in Settings → AI.
zh_hans: 作业批改需要具备视觉能力且配有 API 密钥的服务商——OpenAI、Claude、Qwen、Doubao、Zhipu 或 Kimi。请在“设置 → AI”中添加。

source: Workbook grading needs a vision-capable provider with an API key (OpenAI, Claude, Qwen, Doubao, Zhipu, or Kimi). Configure one in Settings → AI.
zh_hans: 作业批改需要支持图像的 AI 服务商及其 API 密钥（OpenAI、Claude、通义千问、豆包、智谱或 Kimi）。请在 设置 → AI 中配置。

source: Write or Paste Text…
zh_hans: 输入或粘贴文本…

source: Writing your story…
zh_hans: 正在创作故事…

source: Written
zh_hans: 自写

source: Wrong
zh_hans: 错误

source: Yesterday
zh_hans: 昨天

source: You most often hear tone %1$d as tone %2$d — listen for that contrast.
zh_hans: 你最常把%1$d声听成%2$d声——注意分辨这两个声调。

source: You've reviewed all %lld cards in this session
zh_hans: 您已在本次学习中复习了全部 %lld 张卡片

source: You've seen all available cards
zh_hans: 您已浏览过所有卡片

source: Z to A
zh_hans: Z 到 A

source: Your answer
zh_hans: 你的答案

source: Your Reading Library
zh_hans: 你的阅读库

source: Your speech will be transcribed and translated
zh_hans: 您的语音将被转录并翻译

source: Your translation history will appear here
zh_hans: 您的翻译历史将显示在这里

source: Your translations will appear here
zh_hans: 您的翻译记录将显示在这里

source: Your vocabulary has been exported successfully.
zh_hans: 您的词汇已成功导出。

# 中文
source: Chinese
zh_hans: 中文

# 中文 (Chinese)
source: Chinese
zh_hans: 中文

# 中文→英文
source: Chinese → English
zh_hans: 中文→英文

# 作业批改 · Grade Workbook
source: Grade Workbook
zh_hans: 作业批改

# 作业批改 · Grading
source: Grading
zh_hans: 作业批改

# 作业页面 · Workbook pages
source: Workbook pages
zh_hans: 作业页面

# 保存
source: Save
zh_hans: 保存

# 保存全部到词汇本
source: Save All to Vocabulary
zh_hans: 保存全部到词汇本

# 保存到词汇本
source: Save to Vocabulary
zh_hans: 保存到词汇本

# 保存所有单词到词汇本
source: Save All Words to Vocabulary
zh_hans: 保存所有单词到词汇本

# 保存所有词汇到词汇本
source: Save All Vocabulary
zh_hans: 保存所有词汇到词汇本

# 保存所有错题词汇到词汇本
source: Save All Wrong-Answer Vocabulary
zh_hans: 保存所有错题词汇到词汇本

# 关闭
source: Close
zh_hans: 关闭

# 分析结果
source: Analysis Result
zh_hans: 分析结果

# 分析翻译
source: Analyze Translation
zh_hans: 分析翻译

# 加载中…
source: Loading…
zh_hans: 加载中…

# 单独答案（可选）· Separate answers (optional)
source: Separate answers (optional)
zh_hans: 单独答案（可选）

# 单词详情
source: Word Details
zh_hans: 单词详情

# 原形
source: Base Form
zh_hans: 原形

# 取消
source: Cancel
zh_hans: 取消

# 同类词例: %@
source: Similar words: %@
zh_hans: 同类词例: %@

# 处理失败
source: Processing Failed
zh_hans: 处理失败

# 完成
source: Done
zh_hans: 完成

# 已保存
source: Saved
zh_hans: 已保存

# 开始批改 · Grade
source: Grade
zh_hans: 开始批改

# 当前形式
source: Current Form
zh_hans: 当前形式

# 您的设备不支持文字扫描功能
source: Your device does not support text scanning
zh_hans: 您的设备不支持文字扫描功能

# 扫描文字
source: Scan Text
zh_hans: 扫描文字

# 批改中…
source: Grading…
zh_hans: 批改中…

# 拍摄或选择图片，自动识别文字并翻译 支持中文↔英文双向翻译
source: Take or choose a photo to automatically recognize and translate text Supports two-way Chinese ↔ English translation
zh_hans: 拍摄或选择图片，自动识别文字并翻译 支持中文↔英文双向翻译

# 拍照翻译
source: Photo Translate
zh_hans: 拍照翻译

# 拖放图片到此 · Drag & drop images here
source: Drag & drop images here
zh_hans: 拖放图片到此

# 文件
source: Files
zh_hans: 文件

# 文件 · Files
source: Files
zh_hans: 文件

# 显示语法知识点
source: Show Grammar Points
zh_hans: 显示语法知识点

# 朗读英文
source: Read English Aloud
zh_hans: 朗读英文

# 正在处理...
source: Processing...
zh_hans: 正在处理...

# 正在批改作业…
source: Grading workbook…
zh_hans: 正在批改作业…

# 正在翻译...
source: Translating...
zh_hans: 正在翻译...

# 正确 %lld · 共 %lld 题
source: %1$lld correct · %2$lld total
zh_hans: 正确 %1$lld · 共 %2$lld 题

# 清除
source: Clear
zh_hans: 清除

# 清除内容
source: Clear Content
zh_hans: 清除内容

# 照片
source: Photos
zh_hans: 照片

# 照片 · Photos
source: Photos
zh_hans: 照片

# 相机不可用
source: Camera Unavailable
zh_hans: 相机不可用

# 相机扫描
source: Camera Scan
zh_hans: 相机扫描

# 相机扫描功能仅在 iOS 设备上可用
source: Camera scanning is only available on iOS devices
zh_hans: 相机扫描功能仅在 iOS 设备上可用

# 移除 · Remove
source: Remove
zh_hans: 移除

# 第 %@ 题
source: Question %@
zh_hans: 第 %@ 题

# 粘贴
source: Paste
zh_hans: 粘贴

# 翻译中...
source: Translating...
zh_hans: 翻译中...

# 翻译全部
source: Translate All
zh_hans: 翻译全部

# 自定义提示（可选）· Custom instructions
source: Custom instructions
zh_hans: 自定义提示（可选）

# 英文→中文
source: English → Chinese
zh_hans: 英文→中文

# 英文翻译
source: English Translation
zh_hans: 英文翻译

# 识别到的文字
source: Recognized Text
zh_hans: 识别到的文字

# 识别语言
source: Scan Language
zh_hans: 识别语言

# 识别语言 · Scan Language
source: Scan Language
zh_hans: 识别语言

# 识别语言: %@
source: Scan Language: %@
zh_hans: 识别语言: %@

# 词形变化
source: Word Forms
zh_hans: 词形变化

# 词性说明
source: Part of Speech
zh_hans: 词性说明

# 语法知识点
source: Grammar Points
zh_hans: 语法知识点

# 请在设置中允许相机访问权限
source: Please allow camera access in Settings
zh_hans: 请在设置中允许相机访问权限

# 输入中文或英文文本
source: Enter Chinese or English text
zh_hans: 输入中文或英文文本

# 输入或粘贴文字内容（支持中英文）...
source: Type or paste text (Chinese or English)...
zh_hans: 输入或粘贴文字内容（支持中英文）...

# 逐词分析
source: Word-by-Word Analysis
zh_hans: 逐词分析

# 逐词释义
source: Word-by-Word Definitions
zh_hans: 逐词释义

# 重新识别
source: Rescan
zh_hans: 重新识别

# 重试
source: Retry
zh_hans: 重试

source: %lld files · %@
zh_hans: %1$lld 个文件 · %2$@

source: Add a MiniMax API key before using AI Audio.
zh_hans: 使用 AI 语音前，请先添加 MiniMax API 密钥。

source: AI Audio
zh_hans: AI 语音

source: AI Audio Error
zh_hans: AI 语音错误

source: API Region
zh_hans: API 区域

source: Audio
zh_hans: 音频

source: Audio Input
zh_hans: 音频输入

source: Chinese (Simplified)
zh_hans: 中文（简体）

source: Chinese (Traditional)
zh_hans: 中文（繁体）

source: Choose a local audio file up to 100 megabytes
zh_hans: 选择不超过 100 MB 的本地音频文件

source: Clear Saved Audio
zh_hans: 清除已保存音频

source: Clear Saved Audio?
zh_hans: 清除已保存音频？

source: Delete saved audio
zh_hans: 删除已保存音频

source: Enable AI Audio and use any read-aloud button. Generated clips will appear here for replay and export.
zh_hans: 开启 AI 语音后，使用任意朗读按钮。生成的音频会显示在这里，供重播和导出。

source: English Voice ID
zh_hans: 英文音色 ID

source: Export…
zh_hans: 导出…

source: Generate Paid Preview
zh_hans: 生成付费试听

source: Generated MP3 files stay in SwiftMandarin until you delete them. Exported copies remain wherever you save or share them.
zh_hans: 生成的 MP3 会保存在 SwiftMandarin 中，直到你将其删除。已导出的副本会保留在你保存或分享的位置。

source: Get a MiniMax API key
zh_hans: 获取 MiniMax API 密钥

source: Image & Text
zh_hans: 图像与文字

source: Input Type
zh_hans: 输入类型

source: International
zh_hans: 国际

source: Loading saved audio…
zh_hans: 正在载入已保存音频…

source: Local Library
zh_hans: 本地音频库

source: Mainland China
zh_hans: 中国大陆

source: Manage Saved Audio
zh_hans: 管理已保存音频

source: Mandarin Voice ID
zh_hans: 普通话音色 ID

source: MiniMax API Key
zh_hans: MiniMax API 密钥

source: MiniMax Connection
zh_hans: MiniMax 连接

source: MiniMax generates mono MP3 audio at 32 kHz and 128 kbps. The system voice fallback keeps read-aloud available when the network, key, balance, or selected voice is unavailable.
zh_hans: MiniMax 会生成 32 kHz、128 kbps 的单声道 MP3。网络、密钥、余额或所选音色不可用时，系统语音回退仍可继续朗读。

source: Multimodal Translation
zh_hans: 多模态翻译

source: Multimodal input type
zh_hans: 多模态输入类型

source: No audio selected
zh_hans: 尚未选择音频

source: No Saved Audio
zh_hans: 暂无已保存音频

source: Off
zh_hans: 关

source: On
zh_hans: 开

source: Play
zh_hans: 播放

source: Play preview
zh_hans: 播放试听

source: Preparing audio preview…
zh_hans: 正在准备音频试听…

source: Recognition Language
zh_hans: 识别语言

source: Record a clip or choose an M4A, MP3, WAV, AIFF, or CAF file.
zh_hans: 录制一段音频，或选择 M4A、MP3、WAV、AIFF 或 CAF 文件。

source: Record Audio
zh_hans: 录制音频

source: Record or upload
zh_hans: 录音或上传

source: Recording in progress
zh_hans: 正在录音

source: Recording… Tap Stop Recording when finished.
zh_hans: 正在录音…完成后请点按“停止录音”。

source: Remove selected audio
zh_hans: 移除所选音频

source: Replace File
zh_hans: 替换文件

source: Requests microphone access and begins a new recording
zh_hans: 请求麦克风权限并开始新录音

source: Saved Audio
zh_hans: 已保存音频

source: Saved Audio Error
zh_hans: 已保存音频错误
